src/cf/DocumentJournals/БанковскиеВыписки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DocumentJournal>
		<Properties>
			<Name>БанковскиеВыписки</Name>
			<RegisteredDocuments>
				<xr:Item>Document.ПоступлениеНаРасчетныйСчет</xr:Item>
				<xr:Item>Document.СписаниеСРасчетногоСчета</xr:Item>
			</RegisteredDocuments>
		</Properties>
		<ChildObjects>
			<Column>
				<Properties>
					<Name>Организация</Name>
					<References>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.Организация</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.Организация</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>БанковскийСчет</Name>
					<References>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.СчетОрганизации</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.СчетОрганизации</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Контрагент</Name>
					<References>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.Контрагент</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.Контрагент</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Поступление</Name>
					<References>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.СуммаДокумента</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Списание</Name>
					<References>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.СуммаДокумента</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Валюта</Name>
					<References>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.ВалютаДокумента</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.ВалютаДокумента</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ВидОперации</Name>
					<References>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.ВидОперации</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.ВидОперации</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<References>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.ДатаВходящегоДокумента</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.ДатаВходящегоДокумента</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<References>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.НомерВходящегоДокумента</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.НомерВходящегоДокумента</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<References>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.РучнаяКорректировка</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<References>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.НазначениеПлатежа</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.НазначениеПлатежа</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Ответственный</Name>
					<References>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.Ответственный</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Комментарий</Name>
					<References>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.Комментарий</xr:Item>
					</References>
				</Properties>
			</Column>
		</ChildObjects>
	</DocumentJournal>
</MetaDataObject>

src/cf/Enums/ВидыОперацийСписаниеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОперацийСписаниеДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПокупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводНаДругойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеПодотчетномуЛицу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеЗП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеЗаработнойПлатыРаботнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеДепонентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗаймаРаботнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеСредстваПредпринимателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееСписание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыОперацийПКО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПКО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РозничнаяВыручка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПодотчетногоЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеНаличныхВБанке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗаймаРаботником</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеСредстваПредпринимателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочийПриход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыОперацийРКО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРКО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПокупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УплатаНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаПодотчетномуЛицу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗаработнойПлатыПоВедомостям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗаработнойПлатыРаботнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносНаличнымиВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инкассация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаДепонентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗаймаРаботнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеСредстваПредпринимателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочийРасход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DocumentJournals/БанковскиеВыписки/Forms/ПеремещенияДенежныхСредств/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
//

&НаСервере
Процедура ОбновитьСписокДокументов()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоДня",            НачалоДня(ЗначенияПараметров.ДатаВыписки));
	Запрос.УстановитьПараметр("КонецДня",             КонецДня(ЗначенияПараметров.ДатаВыписки));
	Запрос.УстановитьПараметр("БанковскийСчетИтогов", ЗначенияПараметров.БанковскийСчет);
	Запрос.УстановитьПараметр("Организация",          ЗначенияПараметров.Организация);
	Запрос.УстановитьПараметр("СинонимСписание",      Метаданные.Документы.СписаниеСРасчетногоСчета.Синоним);
	Запрос.УстановитьПараметр("СинонимПКО",           Метаданные.Документы.ПриходныйКассовыйОрдер.Синоним);
	Запрос.УстановитьПараметр("СинонимРКО",           Метаданные.Документы.РасходныйКассовыйОрдер.Синоним);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СписаниеСРасчетногоСчета.Дата,
	|	СписаниеСРасчетногоСчета.Номер,
	|	0 КАК Списано,
	|	СписаниеСРасчетногоСчета.СуммаДокумента КАК Поступило,
	|	СписаниеСРасчетногоСчета.Ссылка,
	|	ВЫБОР
	|		КОГДА СписаниеСРасчетногоСчета.РучнаяКорректировка = ИСТИНА
	|			ТОГДА ВЫБОР
	|					КОГДА СписаниеСРасчетногоСчета.ПометкаУдаления = ИСТИНА
	|						ТОГДА 10
	|					КОГДА СписаниеСРасчетногоСчета.Проведен = ЛОЖЬ
	|						ТОГДА 9
	|					ИНАЧЕ 8
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СписаниеСРасчетногоСчета.ПометкаУдаления = ИСТИНА
	|					ТОГДА 2
	|				КОГДА СписаниеСРасчетногоСчета.Проведен = ИСТИНА
	|					ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК НомерКартинки,
	|	СписаниеСРасчетногоСчета.ПометкаУдаления КАК ПометкаУдаления,
	|	&СинонимСписание КАК ВидДокумента
	|ИЗ
	|	Документ.СписаниеСРасчетногоСчета КАК СписаниеСРасчетногоСчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
	|		ПО СписаниеСРасчетногоСчета.СчетКонтрагента = БанковскиеСчета.Ссылка
	|			И (БанковскиеСчета.Ссылка = &БанковскийСчетИтогов)
	|			И (СписаниеСРасчетногоСчета.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСписаниеДенежныхСредств.ПереводНаДругойСчет))
	|			И (СписаниеСРасчетногоСчета.Организация = &Организация)
	|			И (СписаниеСРасчетногоСчета.Дата МЕЖДУ &НачалоДня И &КонецДня)
	|			И (СписаниеСРасчетногоСчета.Проведен = ИСТИНА)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриходныйКассовыйОрдер.Дата,
	|	ПриходныйКассовыйОрдер.Номер,
	|	ПриходныйКассовыйОрдер.СуммаДокумента,
	|	0,
	|	ПриходныйКассовыйОрдер.Ссылка,
	|	ВЫБОР
	|		КОГДА ПриходныйКассовыйОрдер.РучнаяКорректировка = ИСТИНА
	|			ТОГДА ВЫБОР
	|					КОГДА ПриходныйКассовыйОрдер.ПометкаУдаления = ИСТИНА
	|						ТОГДА 10
	|					КОГДА ПриходныйКассовыйОрдер.Проведен = ЛОЖЬ
	|						ТОГДА 9
	|					ИНАЧЕ 8
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПриходныйКассовыйОрдер.ПометкаУдаления = ИСТИНА
	|					ТОГДА 2
	|				КОГДА ПриходныйКассовыйОрдер.Проведен = ИСТИНА
	|					ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ПриходныйКассовыйОрдер.ПометкаУдаления,
	|	&СинонимПКО
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
	|		ПО ПриходныйКассовыйОрдер.Контрагент = БанковскиеСчета.Ссылка
	|			И (БанковскиеСчета.Ссылка = &БанковскийСчетИтогов)
	|			И (ПриходныйКассовыйОрдер.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПКО.ПолучениеНаличныхВБанке))
	|			И (ПриходныйКассовыйОрдер.Организация = &Организация)
	|			И (ПриходныйКассовыйОрдер.Дата МЕЖДУ &НачалоДня И &КонецДня)
	|			И (ПриходныйКассовыйОрдер.Проведен = ИСТИНА)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасходныйКассовыйОрдер.Дата,
	|	РасходныйКассовыйОрдер.Номер,
	|	0,
	|	РасходныйКассовыйОрдер.СуммаДокумента,
	|	РасходныйКассовыйОрдер.Ссылка,
	|	ВЫБОР
	|		КОГДА РасходныйКассовыйОрдер.РучнаяКорректировка = ИСТИНА
	|			ТОГДА ВЫБОР
	|					КОГДА РасходныйКассовыйОрдер.ПометкаУдаления = ИСТИНА
	|						ТОГДА 10
	|					КОГДА РасходныйКассовыйОрдер.Проведен = ЛОЖЬ
	|						ТОГДА 9
	|					ИНАЧЕ 8
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РасходныйКассовыйОрдер.ПометкаУдаления = ИСТИНА
	|					ТОГДА 2
	|				КОГДА РасходныйКассовыйОрдер.Проведен = ИСТИНА
	|					ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ,
	|	РасходныйКассовыйОрдер.ПометкаУдаления,
	|	&СинонимРКО
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
	|		ПО РасходныйКассовыйОрдер.СчетОрганизации = БанковскиеСчета.Ссылка
	|			И (БанковскиеСчета.Ссылка = &БанковскийСчетИтогов)
	|			И (РасходныйКассовыйОрдер.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ВзносНаличнымиВБанк))
	|			И (РасходныйКассовыйОрдер.Организация = &Организация)
	|			И (РасходныйКассовыйОрдер.Дата МЕЖДУ &НачалоДня И &КонецДня)
	|			И (РасходныйКассовыйОрдер.Проведен = ИСТИНА)";
	
	СписокДокументов.Загрузить(Запрос.Выполнить().Выгрузить());
	Элементы.СписокДокументовСписано.ТекстПодвала   = СписокДокументов.Итог("Списано");
	Элементы.СписокДокументовПоступило.ТекстПодвала = СписокДокументов.Итог("Поступило");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИзменитьПометкуНаУдаление(Знач СсылкаНаДокумент, ТекущееЗначениеПометкиНаУдаление)
	
	ДокументОбъект = СсылкаНаДокумент.ПолучитьОбъект();
	
	Попытка
	
		ДокументОбъект.УстановитьПометкуУдаления(НЕ ТекущееЗначениеПометкиНаУдаление);
		ТекущееЗначениеПометкиНаУдаление = НЕ ТекущееЗначениеПометкиНаУдаление;
		Возврат Истина;
	
	Исключение
		
		Возврат ОписаниеОшибки();
		
	КонецПопытки;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ
//

&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтрокаДокумента = СписокДокументов.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если СтрокаДокумента <> Неопределено И ЗначениеЗаполнено(СтрокаДокумента.Ссылка) Тогда
		ПоказатьЗначение( , СтрокаДокумента.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = истина;
	СтрокаДокумента = Элементы.СписокДокументов.ТекущиеДанные;
	Если СтрокаДокумента <> Неопределено И ЗначениеЗаполнено(СтрокаДокумента.Ссылка) Тогда
		ПоказатьЗначение( , СтрокаДокумента.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	ТекущаяСтрока = Элементы.СписокДокументов.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущаяСтрока.Ссылка) Тогда
		Если ТекущаяСтрока.ПометкаУдаления Тогда
			ТекстВопроса = НСтр("ru = 'Снять с ""%1"" пометку на удаление?'");
		Иначе
			ТекстВопроса = НСтр("ru = 'Пометить ""%1"" на удаление?'");
		КонецЕсли;
		
		ОбозначениеДокумента = ТекущаяСтрока.ВидДокумента + " " + ТекущаяСтрока.Номер + " от " + ТекущаяСтрока.Дата;
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстВопроса, ОбозначениеДокумента);
		
		Оповещение = Новый ОписаниеОповещения("ВопросСнятьПометитьНаУдалениеЗавершение", ЭтотОбъект, ТекущаяСтрока);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросСнятьПометитьНаУдалениеЗавершение(Результат, ТекущаяСтрока) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		РезультатУстановки = ИзменитьПометкуНаУдаление(ТекущаяСтрока.Ссылка, ТекущаяСтрока.ПометкаУдаления);
		Если РезультатУстановки = Истина Тогда
			ТекущаяСтрока.НомерКартинки = ?(ТекущаяСтрока.ПометкаУдаления, 2, 0);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	
	ОбновитьСписокДокументов();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
//

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗначенияПараметров = Новый Структура("Организация, БанковскийСчет, ДатаВыписки");
	Параметры.Свойство("Организация",    ЗначенияПараметров.Организация);
	Параметры.Свойство("БанковскийСчет", ЗначенияПараметров.БанковскийСчет);
	Параметры.Свойство("ДатаВыписки",    ЗначенияПараметров.ДатаВыписки);
	
	Если НЕ ЗначениеЗаполнено(ЗначенияПараметров.Организация) И ЗначениеЗаполнено(ЗначенияПараметров.БанковскийСчет) Тогда
		ЗначенияПараметров.Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗначенияПараметров.БанковскийСчет, "Владелец");
	КонецЕсли;
	
	НадписьПеремещения = НСтр("ru = 'Перемещения денежных средств в организации %1'");
	НадписьПеремещения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НадписьПеремещения,
		?(ЗначениеЗаполнено(ЗначенияПараметров.Организация), ЗначенияПараметров.Организация, НСтр("ru = '<не указана>'")));
	
	Если ЗначениеЗаполнено(ЗначенияПараметров.БанковскийСчет) Тогда
		ТекстПеремещения = НСтр("ru = '%1: р/с ""%2""'");
		НадписьПеремещения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстПеремещения,
			НадписьПеремещения, ЗначенияПараметров.БанковскийСчет);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначенияПараметров.ДатаВыписки) Тогда
		ТекстПеремещения = НСтр("ru = '%1: на дату %2'");
		НадписьПеремещения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстПеремещения,
			НадписьПеремещения, Формат(ЗначенияПараметров.ДатаВыписки, "ДЛФ=DD"));
	КонецЕсли;
	
	ОбновитьСписокДокументов();
	
КонецПроцедуры
